Arquivotheca/solaris11/usr/src/uts/common/io/mcxe/mcxe.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 *  Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * Copyright (c) 2010 Mellanox Technologies. All rights reserved.
 */

#include "mcxe.h"

static char mcxe_ident[] = "Mellanox ConnectX-2 10 Gigbit Ethernet Driver";

static void *mcxe_statep;
int mcxe_verbose = 0;

#define	MCXE_DMA_RX_ALIGNMENT	0x0000000000001000ull	/* 4K */

const char *setportstr[] = {
	[MCXE_SET_PORT_GENERAL] = "port general",
	[MCXE_SET_PORT_RQP_CALC] = "rqp calc",
	[MCXE_SET_PORT_MAC_TABLE] = "mac table",
	[MCXE_SET_PORT_VLAN_TABLE] = "vlan table",
	[MCXE_SET_PORT_PRIO_MAP] = "prio map"
};

static ddi_dma_attr_t mcxe_dma_buf_attr = {
	DMA_ATTR_V0,			/* version number */
	0x0000000000000000ull,		/* low address */
	0xFFFFFFFFFFFFFFFFull,		/* high address */
	0x00000000FFFFFFFFull,		/* dma counter max */
	MCXE_DMA_RX_ALIGNMENT,		/* alignment */
	0x00000FFF,			/* burst sizes */
	0x00000001,			/* minimum transfer size */
	0x00000000FFFFFFFFull,		/* maximum transfer size */
	0xFFFFFFFFFFFFFFFFull,		/* maximum segment size */
	1,				/* scatter/gather list length */
	0x00000001,			/* granularity */
	DDI_DMA_FLAGERR			/* DMA flags */
};

static ddi_dma_attr_t mcxe_dma_tx_attr = {
	DMA_ATTR_V0,			/* version number */
	0x0000000000000000ull,		/* low address */
	0xFFFFFFFFFFFFFFFFull,		/* high address */
	0x00000000FFFFFFFFull,		/* dma counter max */
	1,				/* alignment */
	0x00000FFF,			/* burst sizes */
	0x00000001,			/* minimum transfer size */
	0x00000000FFFFFFFFull,		/* maximum transfer size */
	0xFFFFFFFFFFFFFFFFull,		/* maximum segment size  */
	MCXE_MAX_COOKIE,		/* scatter/gather list length */
	0x00000001,			/* granularity */
	DDI_DMA_FLAGERR			/* DMA flags */
};

/*
 * DMA access attributes for buffers.
 */
static ddi_device_acc_attr_t mcxe_buf_acc_attr = {
	DDI_DEVICE_ATTR_V0,
	DDI_NEVERSWAP_ACC,
	DDI_STRICTORDER_ACC
};

/*
 * Get the corresponding mcxe port pointer from its mcxnex state.
 */
static mcxe_port_t *
mcxe_state_to_port(mcxnex_state_t *mcxnex_state, int port_num)
{
	dev_info_t *dc;
	int port_inst;
	mcxe_port_t *port;

	for (dc = ddi_get_child(mcxnex_state->hs_dip); dc != NULL;
	    dc = ddi_get_next_sibling(dc)) {

		port_inst = ddi_get_instance(dc);
		port = ddi_get_soft_state(mcxe_statep, port_inst);

		if (port == NULL)
			continue;

		if (port->phys_port_num == port_num)
			return (port);
	}

	return (NULL);
}

static void
mcxe_free_dma_buffer(dma_buffer_t *buf)
{
	if (buf->dma_handle != NULL) {
		if (buf->dma_address) {
			(void) ddi_dma_unbind_handle(buf->dma_handle);
			buf->dma_address = 0;
		}
		ddi_dma_free_handle(&buf->dma_handle);
		buf->dma_handle = NULL;
	}

	if (buf->acc_handle != NULL) {
		ddi_dma_mem_free(&buf->acc_handle);
		buf->acc_handle = NULL;
	}

	buf->size = 0;
	buf->len = 0;
}

static int
mcxe_alloc_dma_buffer(mcxe_port_t *port, dma_buffer_t *buf, size_t size)
{
	dev_info_t *devinfo = port->devinfo;
	ddi_dma_cookie_t cookie;
	size_t len;
	uint_t cookie_num;
	int ret;

	ret = ddi_dma_alloc_handle(devinfo,
	    &mcxe_dma_buf_attr, DDI_DMA_DONTWAIT,
	    NULL, &buf->dma_handle);
	if (ret != DDI_SUCCESS) {
		buf->dma_handle = NULL;
		cmn_err(CE_WARN, "!failed to allocate dma handle.");
		return (ret);
	}

	ret = ddi_dma_mem_alloc(buf->dma_handle,
	    size, &mcxe_buf_acc_attr, DDI_DMA_STREAMING,
	    DDI_DMA_DONTWAIT, NULL, &buf->address,
	    &len, &buf->acc_handle);
	if (ret != DDI_SUCCESS) {
		buf->acc_handle = NULL;
		ddi_dma_free_handle(&buf->dma_handle);
		buf->dma_handle = NULL;
		cmn_err(CE_WARN, "!failed to allocate dma memory.");
		return (ret);
	}

	ret = ddi_dma_addr_bind_handle(buf->dma_handle, NULL,
	    buf->address,
	    len, DDI_DMA_RDWR | DDI_DMA_STREAMING,
	    DDI_DMA_DONTWAIT, NULL, &cookie, &cookie_num);
	if (ret != DDI_DMA_MAPPED) {
		buf->dma_address = NULL;
		ddi_dma_mem_free(&buf->acc_handle);
		buf->acc_handle = NULL;
		ddi_dma_free_handle(&buf->dma_handle);
		buf->dma_handle = NULL;
		cmn_err(CE_WARN, "!failed to bind dma handle(ret=%x).", ret);
		return (ret);
	}

	ASSERT(cookie_num == 1);

	buf->dma_address = cookie.dmac_laddress;
	buf->size = len;
	buf->len = 0;

	return (DDI_SUCCESS);
}

static int
mcxe_alloc_tx_qp(struct mcxe_tx_ring *tx_ring)
{
	mcxe_port_t *port = tx_ring->port;
	ibt_qp_alloc_attr_t qp_attr;
	mcxnex_qp_info_t qp_info;
	ib_qpn_t qpn;
	int ret;

	bzero(&qp_attr, sizeof (qp_attr));
	bzero(&qp_info, sizeof (qp_info));
	bzero(&qpn, sizeof (qpn));

	qp_info.qpi_qpn = &qpn;
	qp_info.qpi_attrp = &qp_attr;

	/* setup the qp attrs for the alloc call */
	qp_attr.qp_ibc_scq_hdl = (ibt_opaque1_t)tx_ring->tx_cq;
	qp_attr.qp_ibc_rcq_hdl = (ibt_opaque1_t)tx_ring->tx_cq;
	qp_attr.qp_pd_hdl = (ibt_pd_hdl_t)port->mcxnex_state->hs_pdhdl_internal;
	qp_attr.qp_sizes.cs_sq_sgl = port->max_tx_frags;
	qp_attr.qp_sizes.cs_rq_sgl = 1;
	qp_attr.qp_sizes.cs_sq = port->tx_ring_size;
	qp_attr.qp_sizes.cs_rq = 1;
	qp_attr.qp_flags = IBT_ALL_SIGNALED | IBT_FAST_REG_RES_LKEY;
	qp_attr.qp_alloc_flags = IBT_QP_NO_FLAGS;
	qp_info.qpi_type = IBT_RAWETHER_RQP;

	ret = mcxnex_qp_alloc(port->mcxnex_state, &qp_info, DDI_NOSLEEP);
	if (ret != DDI_SUCCESS) {
		cmn_err(CE_WARN, "!mcxe_alloc_tx_qp() failed(ret=%d).", ret);
		return (DDI_FAILURE);
	}

	tx_ring->tx_qp = qp_info.qpi_qphdl;

