Arquivotheca/solaris11/usr/src/uts/common/io/mcxe/mcxe.c
	if (mcxe_verbose) {
		cmn_err(CE_NOTE, "!mcxe%d: created tx qp %x\n",
		    port->instance, tx_ring->tx_qp->qp_qpnum);
	}

	return (DDI_SUCCESS);
}

static int
mcxe_alloc_rx_qp(struct mcxe_rx_ring *rx_ring)
{
	mcxe_port_t *port = rx_ring->port;
	ibt_qp_alloc_attr_t qp_attr;
	mcxnex_qp_info_t qp_info;
	ib_qpn_t qpn;
	int ret;

	bzero(&qp_attr, sizeof (qp_attr));
	bzero(&qp_info, sizeof (qp_info));
	bzero(&qpn, sizeof (qpn));

	qp_info.qpi_qpn = &qpn;
	qp_info.qpi_attrp = &qp_attr;

	/* setup the qp attrs for the alloc call */
	qp_attr.qp_ibc_scq_hdl = (ibt_opaque1_t)rx_ring->rx_cq;
	qp_attr.qp_ibc_rcq_hdl = (ibt_opaque1_t)rx_ring->rx_cq;
	qp_attr.qp_pd_hdl = (ibt_pd_hdl_t)port->mcxnex_state->hs_pdhdl_internal;
	qp_attr.qp_sizes.cs_sq_sgl = 1;
	qp_attr.qp_sizes.cs_rq_sgl = 1;
	qp_attr.qp_sizes.cs_sq = 1;
	qp_attr.qp_sizes.cs_rq = port->rx_ring_size;
	qp_attr.qp_flags = IBT_ALL_SIGNALED | IBT_FAST_REG_RES_LKEY;
	qp_attr.qp_alloc_flags = IBT_QP_LINK_TYPE_ETH;
	if (port->mcxnex_state->hs_vlan_strip_off_cap)
		qp_attr.qp_alloc_flags |= IBT_QP_VLAN_STRIP_OFF;
	qp_info.qpi_type = IBT_RAWETHER_RQP;

	ret = mcxnex_qp_alloc(port->mcxnex_state, &qp_info, DDI_NOSLEEP);
	if (ret != DDI_SUCCESS) {
		cmn_err(CE_WARN, "!mcxe_alloc_rx_qp() failed(ret=%d).", ret);
		return (DDI_FAILURE);
	}

	rx_ring->rx_qp = qp_info.qpi_qphdl;

	if (mcxe_verbose) {
		cmn_err(CE_NOTE, "!mcxe%d: created rx qp %x\n",
		    port->instance, rx_ring->rx_qp->qp_qpnum);
	}
	return (DDI_SUCCESS);
}

static int
mcxe_disable_qp(struct mcxe_port *port, mcxnex_qphdl_t qphdl)
{
	int ret;
	ibt_cep_modify_flags_t qp_mod_flags;
	ibt_qp_info_t qp_info;

	bzero(&qp_info, sizeof (qp_info));

	qp_info.qp_transport.ud.ud_port = port->phys_port_num;
	qp_info.qp_trans = IBT_RAWETHER_SRV;
	qp_mod_flags = IBT_CEP_SET_STATE;

	/* QP state ==> Reset */
	qp_info.qp_current_state = IBT_STATE_RTS;
	qp_info.qp_state = IBT_STATE_RESET;
	ret = mcxnex_qp_modify(port->mcxnex_state, qphdl, qp_mod_flags,
	    &qp_info, NULL);
	if (ret) {
		cmn_err(CE_WARN, "!mcxe_disable_qp: failed to modify qp 0x%06x"
		    " to RESET state(ret=%d).", qphdl->qp_qpnum, ret);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}

static int
mcxe_enable_qp(mcxe_port_t *port, mcxnex_qphdl_t qphdl)
{
	int ret;
	ibt_cep_modify_flags_t qp_mod_flags;
	ibt_qp_info_t qp_info;

	bzero(&qp_info, sizeof (qp_info));
	qp_info.qp_transport.ud.ud_port = port->phys_port_num;
	qp_info.qp_trans = IBT_RAWETHER_SRV;

	/* QP state ==> INIT */
	qp_mod_flags = IBT_CEP_SET_RESET_INIT | IBT_CEP_SET_STATE |
	    IBT_CEP_SET_PORT;
	qp_info.qp_current_state = IBT_STATE_RESET;
	qp_info.qp_state = IBT_STATE_INIT;
	ret = mcxnex_qp_modify(port->mcxnex_state, qphdl, qp_mod_flags,
	    &qp_info, NULL);
	if (ret) {
		cmn_err(CE_WARN, "!mcxe_enable_qp: failed to modify qp 0x%06x"
		    " to INIT state(ret=%d).", qphdl->qp_qpnum, ret);
		return (DDI_FAILURE);
	}

	/* QP state ==> RTR */
	qp_mod_flags = IBT_CEP_SET_STATE | IBT_CEP_SET_INIT_RTR;
	qp_info.qp_current_state = IBT_STATE_INIT;
	qp_info.qp_state = IBT_STATE_RTR;
	ret = mcxnex_qp_modify(port->mcxnex_state, qphdl, qp_mod_flags,
	    &qp_info, NULL);
	if (ret) {
		cmn_err(CE_WARN, "!mcxe_enable_qp: failed to modify qp 0x%06x"
		    " to RTR state(ret=%d).", qphdl->qp_qpnum, ret);
		return (DDI_FAILURE);
	}

	/* QP state ==> RTS */
	qp_mod_flags = IBT_CEP_SET_STATE | IBT_CEP_SET_RTR_RTS;
	qp_info.qp_current_state = IBT_STATE_RTR;
	qp_info.qp_state = IBT_STATE_RTS;
	ret = mcxnex_qp_modify(port->mcxnex_state, qphdl, qp_mod_flags,
	    &qp_info, NULL);
	if (ret) {
		cmn_err(CE_WARN, "!mcxe_enable_qp: failed to modify qp 0x%06x"
		    " to RTS state(ret=%d).", qphdl->qp_qpnum, ret);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}

/*
 * Post Rx buffer free callback routine after mcxe_m_stop.
 */
void
mcxe_post_rxb_free(struct mcxe_rxbuf *rxb)
{
	struct mcxe_rx_ring *rx_ring = rxb->rx_ring;
	mcxe_port_t *port = rx_ring->port;

	rw_enter(&rx_ring->rc_rwlock, RW_WRITER);
	atomic_dec_32(&rxb->ref_cnt);
	atomic_dec_32(&rx_ring->rxb_pending);
	atomic_dec_32(&port->rxb_pending);
	if (rxb->flag & MCXE_RXB_REUSED) {
		rxb->mp = desballoc((unsigned char *)rxb->dma_buf.address,
		    rxb->dma_buf.size, 0, &rxb->rxb_free_rtn);
		if (rxb->flag & MCXE_RXB_STARTED) {
			(void) mcxe_post_recv(rxb);
			rxb->flag = 0;	/* clear the flag */
		}
		rw_exit(&rx_ring->rc_rwlock);
		return;
	}
	rxb->mp = NULL;
	mcxe_free_dma_buffer(&rxb->dma_buf);
	if (!rx_ring->rxb_pending && rx_ring->rxbuf) {
		kmem_free(rx_ring->rxbuf, port->rx_ring_size *
		    sizeof (struct mcxe_rxbuf));
		rx_ring->rxbuf = NULL;
	}

	if (mcxe_verbose) {
		cmn_err(CE_NOTE,
		    "!mcxe%d: mcxe_post_rxb_free() rxb %d, pending = %d.\n",
		    port->instance, rxb->index, rx_ring->rxb_pending);
	}
	rw_exit(&rx_ring->rc_rwlock);
}

/*
 * ====== h/w operation functions ======
 * Note: mcxe only owns one of two ports of the chip, while
 * mcxnex owns the whole chip. Below h/w functions are port-based.
 */

/*
 * dump the h/w statistics.
 */
static int
mcxe_hw_get_stats(mcxe_port_t *port, uint8_t reset)
{
	int ret;
	uint32_t in_mod;

	ASSERT(mutex_owned(&port->port_lock));

	in_mod = reset << 8 | port->phys_port_num;

	ret = mcxnex_cmn_query_cmd_post(port->mcxnex_state,
	    EN_DUMP_ETH_STATS, 0, in_mod, &port->hw_stats,
	    sizeof (struct mcxe_hw_stats), DDI_SLEEP);
	if (ret != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_WARN, "!mcxe%d: EN_DUMP_ETH_STATS (port %02d) "
		    "command failed: %08x", port->instance,
		    port->phys_port_num, ret);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}

/*
 * mcxe_set_port_gen_cmd_post()
 */
static int
mcxe_set_port_cmd_post(mcxnex_state_t *mcxnex_state, uint_t port, uint16_t op,
    uint16_t mbx_sz, int entry_sz, void *port_gen, uint_t sleepflag)
{
	mcxnex_mbox_info_t mbox_info;
	mcxnex_cmd_post_t cmd;
	uint64_t data;
	int ret, i;

	bzero(&cmd, sizeof (cmd));

	/* Get an "In" mailbox for the command */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX;
	ret = mcxnex_mbox_alloc(mcxnex_state, &mbox_info, sleepflag);
	if (ret != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_WARN,
		    "!mcxe_set_port_cmd_post: alloc mbox failed(status=%d).",
		    ret);
		return (DDI_FAILURE);
	}

