Arquivotheca/solaris11/usr/src/uts/common/io/mcxe/mcxe.c
	/* Copy the "INIT_PORT" command into the mailbox */
	for (i = 0; i < (mbx_sz >> entry_sz); i++) {
		if (entry_sz == 2) {
			data = ((uint32_t *)port_gen)[i];
			ddi_put32(mbox_info.mbi_in->mb_acchdl,
			    ((uint32_t *)mbox_info.mbi_in->mb_addr + i), data);
		} else {
			data = ((uint64_t *)port_gen)[i];
			ddi_put64(mbox_info.mbi_in->mb_acchdl,
			    ((uint64_t *)mbox_info.mbi_in->mb_addr + i), data);
		}
	}

	(void) ddi_dma_sync(mbox_info.mbi_in->mb_rsrcptr->hr_dmahdl,
	    0, mbx_sz, DDI_DMA_SYNC_FORDEV);

	/* Setup and post the mcxnex "SET_PORT" command */
	cmd.cp_inparm = mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm = 0;
	cmd.cp_inmod = op << 8 | port;
	cmd.cp_opcode = SET_PORT;
	cmd.cp_opmod = 1;
	cmd.cp_flags = sleepflag;
	ret = mcxnex_cmd_post(mcxnex_state, &cmd);
	/* Free the mailbox */
	mcxnex_mbox_free(mcxnex_state, &mbox_info);
	if (ret != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_WARN,
		    "!mcxe_set_port_cmd_post: SET_PORT OP=\"%s\" "
		    "failed(status=%d).", setportstr[op], ret);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}

/*
 * mcxe_set_rqpn_calc()
 */
static int
mcxe_set_rqpn_calc(mcxe_port_t *port, uint32_t promisc)
{
	int ret;
	uint32_t base_qpn;
	mcxe_hw_set_port_rqp_calc_cx_t rqp_calc;
	int port_num = port->phys_port_num;

	/* currently only support one rx ring */
	base_qpn = port->rx_rings[0].rx_qp->qp_qpnum;

	bzero(&rqp_calc, sizeof (rqp_calc));
	rqp_calc.base_qpn = base_qpn;
	rqp_calc.promisc = (promisc << SET_PORT_PROMISC_SHIFT) | base_qpn;
	rqp_calc.mcast = (1ULL << SET_PORT_PROMISC_SHIFT) | base_qpn;

	ret = mcxe_set_port_cmd_post(port->mcxnex_state, port_num,
	    MCXE_SET_PORT_RQP_CALC, sizeof (rqp_calc), 2,
	    &rqp_calc, DDI_SLEEP);
	if (ret != DDI_SUCCESS) {
		cmn_err(CE_WARN, "!mcxe%d: mcxe_set_rqpn_calc() failed.",
		    port->instance);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}

/*
 * mcxe_set_vlan_filter()
 *	set up port VLAN filter table.
 */
static int
mcxe_set_vlan_filter(mcxe_port_t *port)
{
	mcxnex_state_t *mcxnex_state = port->mcxnex_state;
	mcxnex_mbox_info_t mbox_info;
	mcxnex_cmd_post_t cmd;
	int ret, i;

	/* Get an "In" mailbox for the command */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX;
	ret = mcxnex_mbox_alloc(mcxnex_state, &mbox_info, DDI_SLEEP);
	if (ret != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_WARN,
		    "!mcxe_set_vlan_filter: alloc mbox failed(status=%d).",
		    ret);
		return (DDI_FAILURE);
	}

	/* clear all filters */
	for (i = 0; i < VLAN_FLTR_SIZE; i++) {
		ddi_put32(mbox_info.mbi_in->mb_acchdl,
		    ((uint32_t *)mbox_info.mbi_in->mb_addr + i), 0xffffffff);
	}

	(void) ddi_dma_sync(mbox_info.mbi_in->mb_rsrcptr->hr_dmahdl,
	    0, VLAN_FLTR_SIZE * 4, DDI_DMA_SYNC_FORDEV);

	/* Setup and post the mcxnex "SET_PORT" command */
	bzero(&cmd, sizeof (cmd));
	cmd.cp_inparm = mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm = 0;
	cmd.cp_inmod = port->phys_port_num;
	cmd.cp_opcode = EN_SET_VLAN_FLTR;
	cmd.cp_opmod = 0;
	cmd.cp_flags = DDI_SLEEP;
	ret = mcxnex_cmd_post(mcxnex_state, &cmd);
	/* Free the mailbox */
	mcxnex_mbox_free(mcxnex_state, &mbox_info);
	if (ret != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_WARN,
		    "!mcxe_set_vlan_filter: EN_SET_VLAN_FLTR cmd post "
		    "failed(status=%d).", ret);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}

/*
 * mcxe_hw_ucast_setup()
 *	set up port MAC table.
 */
static int
mcxe_hw_ucast_setup(struct mcxe_port *port)
{
	int ret;

	ret = mcxe_set_port_cmd_post(port->mcxnex_state,
	    port->phys_port_num,
	    MCXE_SET_PORT_MAC_TABLE,
	    MCXE_MAC_TABLE_SIZE, 3,
	    port->ucast_table,
	    DDI_NOSLEEP);
	if (ret != DDI_SUCCESS) {
		cmn_err(CE_WARN, "!mcxe%d: mcxe_hw_ucast_setup() failed.",
		    port->instance);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}

/*
 * mcxe_hw_ucast_cleanup()
 *	clean up port MAC table.
 */
static int
mcxe_hw_ucast_cleanup(struct mcxe_port *port)
{
	ASSERT(mutex_owned(&port->port_lock));

	bzero(port->ucast_table, sizeof (port->ucast_table));

	return (mcxe_hw_ucast_setup(port));
}

/*
 * mcxe_query_port()
 */
static int
mcxe_query_port(mcxe_port_t *port, struct mcxe_hw_query_port *port_query)
{
	int ret;

	bzero(port_query, sizeof (*port_query));
	ret = mcxnex_cmn_query_cmd_post(port->mcxnex_state, QUERY_PORT, 0,
	    port->phys_port_num, port_query, sizeof (*port_query),
	    DDI_NOSLEEP);
	if (ret != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_WARN, "!mcxe%d: mcxe_query_port() failed(ret=%d).",
		    port->instance, ret);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}

/*
 * mcxe_get_link_state()
 */
static void
mcxe_get_link_state(mcxe_port_t *port)
{
	int ret;
	struct mcxe_hw_query_port port_query;
	link_state_t link_state;

	mutex_enter(&port->port_lock);
	if (!(port->if_state & MCXE_IF_STARTED)) {
		mutex_exit(&port->port_lock);
		return;
	}

	ret = mcxe_query_port(port, &port_query);
	if (ret != DDI_SUCCESS) {
		mutex_exit(&port->port_lock);
		return;
	}

	port->link_duplex = LINK_DUPLEX_FULL;
	if ((port_query.link_speed & MCXE_HW_SPEED_MASK) == MCXE_HW_1G_SPEED)
		port->link_speed = 1000;
	else
		port->link_speed = 10000;

	if (port_query.link_up & MCXE_HW_LINK_UP_MASK)
		link_state = LINK_STATE_UP;
	else
		link_state = LINK_STATE_DOWN;

	if (port->link_state != link_state) {
		port->link_state = link_state;
		mutex_exit(&port->port_lock);
		mac_link_update(port->mac_hdl, port->link_state);
	} else
		mutex_exit(&port->port_lock);
}

/*
 * mcxe_get_primary_mac()
 */
static int
mcxe_get_primary_mac(mcxe_port_t *port)
{
	int ret;
	struct mcxnex_hw_query_port_s hs_queryport;

	bzero(&hs_queryport, sizeof (hs_queryport));
	ret = mcxnex_cmn_query_cmd_post(port->mcxnex_state, QUERY_PORT, 0,
	    port->phys_port_num, &hs_queryport, sizeof (hs_queryport),
	    DDI_NOSLEEP);
	if (ret != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_WARN,
		    "mcxe%d: mcxe_get_primary_mac() QUERY_PORT failed(ret=%d).",
		    port->instance, ret);
		return (DDI_FAILURE);
	}

	port->hw_mac = htonll(hs_queryport.def_mac);

	return (DDI_SUCCESS);
}

/*
 * mcxe_set_primary_mac()
 */
static int
mcxe_set_primary_mac(mcxe_port_t *port, uint64_t hw_mac)
{
	uint64_t entry;

	ASSERT(mutex_owned(&port->port_lock));

	entry = htonll(hw_mac) | 1ULL << MCXE_MAC_VALID_SHIFT;
	port->ucast_table[0] = entry;	/* first entry */

