Arquivotheca/solaris11/usr/src/uts/common/io/mcxe/mcxe.c
	return (mcxe_hw_ucast_setup(port));
}

/*
 * mcxe_set_mcast_filter()
 *	set up multicast filter table.
 */
static int
mcxe_set_mcast_filter(mcxe_port_t *port, const uint8_t *mac, uint64_t clear,
    uint8_t mode)
{
	mcxnex_cmd_post_t cmd;
	int status;
	uint64_t inparm;

	bzero(&cmd, sizeof (cmd));

	if (mac) {
		bcopy(mac, &inparm, ETHERADDRL);
		inparm = ntohll(inparm) >> 16;
	} else
		inparm = 0;

	cmd.cp_inparm = inparm | (clear << 63);
	cmd.cp_outparm = 0;
	cmd.cp_inmod = port->phys_port_num;
	cmd.cp_opcode = EN_SET_MCAST_FLTR;
	cmd.cp_opmod = mode;
	cmd.cp_flags = DDI_SLEEP;
	status = mcxnex_cmd_post(port->mcxnex_state, &cmd);
	if (status != DDI_SUCCESS) {
		cmn_err(CE_WARN, "!mcxe%d: failed to set mcast filter(%x)\n",
		    port->instance, status);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}

/*
 * mcxe_hw_mcast_setup()
 */
static int
mcxe_hw_mcast_setup(mcxe_port_t *port)
{
	int ret, i;
	uint8_t bcast[ETHERADDRL] = { 0xff, 0xff, 0xff,
	    0xff, 0xff, 0xff };

	ASSERT(mutex_owned(&port->port_lock));

	ret = mcxe_set_mcast_filter(port, NULL, 0, EN_MCAST_DISABLE);
	if (ret != DDI_SUCCESS)
		return (DDI_FAILURE);

	ret = mcxe_set_mcast_filter(port, bcast, 1, EN_MCAST_CONFIG);
	if (ret != DDI_SUCCESS)
		return (DDI_FAILURE);

	for (i = 0; i < port->mcast_count; i++) {
		ret = mcxe_set_mcast_filter(port,
		    port->mcast_table[i].ether_addr_octet, 0, EN_MCAST_CONFIG);
		if (ret != DDI_SUCCESS)
			return (DDI_FAILURE);
	}

	ret = mcxe_set_mcast_filter(port, NULL, 0, EN_MCAST_ENABLE);
	if (ret != DDI_SUCCESS)
		return (DDI_FAILURE);

	return (DDI_SUCCESS);
}

/*
 * mcxe_mcast_add()
 *	add specified multicast address
 */
static int
mcxe_mcast_add(mcxe_port_t *port, const uint8_t *mcast_addr)
{
	int ret;

	if ((mcast_addr[0] & 01) == 0) {
		return (EINVAL);
	}

	if (port->mcast_count >= MCXE_MAX_MCAST_NUM) {
		return (ENOENT);
	}

	bcopy(mcast_addr, &port->mcast_table[port->mcast_count],
	    ETHERADDRL);
	port->mcast_count++;

	ret = mcxe_hw_mcast_setup(port);
	if (ret != DDI_SUCCESS)
		return (ret);

	return (0);
}

/*
 * mcxe_mcast_del()
 *	delete specified multicast address
 */
static int
mcxe_mcast_del(mcxe_port_t *port, const uint8_t *mcast_addr)
{
	int ret, i;

	/* find the mcast entry */
	for (i = 0; i < port->mcast_count; i++) {
		if (bcmp(mcast_addr, &port->mcast_table[i],
		    ETHERADDRL) == 0) {
			for (i++; i < port->mcast_count; i++) {
				port->mcast_table[i - 1] =
				    port->mcast_table[i];
			}
			port->mcast_count--;
			break;
		}
	}

	/* failed to find */
	if (i == port->mcast_count) {
		uint64_t entry = 0;

		bcopy(mcast_addr, ((char *)&entry) + 2, ETHERADDRL);
		entry = htonll(entry) | 1ULL << MCXE_MAC_VALID_SHIFT;
		cmn_err(CE_WARN, "!mcxe%d: failed to find mcast address %lx",
		    port->instance, (unsigned long)entry);
		return (EINVAL);
	}

	ret = mcxe_hw_mcast_setup(port);
	if (ret != DDI_SUCCESS)
		return (EINVAL);

	return (0);
}

/*
 * mcxe_hw_enable_promisc()
 *	enable port promiscuous mode
 */
static int
mcxe_hw_enable_promisc(mcxe_port_t *port)
{
	return (mcxe_set_rqpn_calc(port, 1));
}

/*
 * mcxe_hw_disable_promisc()
 *	disable port promiscuous mode
 */
static int
mcxe_hw_disable_promisc(mcxe_port_t *port)
{
	return (mcxe_set_rqpn_calc(port, 0));
}

/*
 * ====== Link change notification functions ======
 */
static void
mcxe_trigger_link_softintr(mcxe_port_t *port)
{
	mutex_enter(&port->link_softintr_lock);
	if (port->link_softintr_flag == 0) {
		port->link_softintr_flag = 1;
		ddi_trigger_softintr(port->link_softintr_id);
	}
	mutex_exit(&port->link_softintr_lock);
}

static uint_t
mcxe_link_softintr_handler(caddr_t arg)
{
	mcxe_port_t *port = (void *) arg;

	mutex_enter(&port->link_softintr_lock);

	if (port->link_softintr_flag == 0) {
		mutex_exit(&port->link_softintr_lock);
		return (DDI_INTR_UNCLAIMED);
	}
	port->link_softintr_flag = 0;
	mutex_exit(&port->link_softintr_lock);

	mcxe_get_link_state(port);

	return (DDI_INTR_CLAIMED);
}

static void
mcxe_async_handler(mcxnex_state_t *mcxnex_state,
    ibt_async_code_t type, ibc_async_event_t *event)
{
	mcxe_port_t *port;

	switch (type) {
	case IBT_EVENT_PORT_UP:
	case IBT_ERROR_PORT_DOWN:
		port = mcxe_state_to_port(mcxnex_state, event->ev_port);
		if (port != NULL)
			mcxe_trigger_link_softintr(port);
		break;
	default:
		cmn_err(CE_WARN,
		    "!mcxe_async_handler: unknown async event 0x%x", type);
		break;
	}
}

/*
 * mcxe_port_timer - timer for link status detection and Tx reschedule
 */
static void
mcxe_port_timer(void *arg)
{
	mcxe_port_t *port = arg;
	struct mcxe_tx_ring *tx_ring = &port->tx_rings[0];

	/* link status detection */
	mcxe_get_link_state(port);

	/* Tx reschedule */
	if ((port->if_state & MCXE_IF_STARTED) &&
	    tx_ring->tx_resched_needed &&
	    (tx_ring->tx_free > tx_ring->tx_buffers_low)) {
		tx_ring->tx_resched_needed = 0;
		mac_tx_update(port->mac_hdl);
		tx_ring->tx_resched++;
	}
}


/*
 * ====== GLD entry points support functions ======
 */
static int
mcxe_init_port(mcxe_port_t *port)
{
	int ret;
	mcxe_hw_set_port_gen_t port_gen;
	int port_num = port->phys_port_num;

	bzero(&port_gen, sizeof (port_gen));

	port_gen.flags = SET_PORT_GEN_ALL_VALID;
	port_gen.mtu = port->max_frame_size;
	port_gen.pptx = 1;
	port_gen.pfctx = 0;
	port_gen.pprx = 1;
	port_gen.pfcrx = 0;

	ret = mcxe_set_port_cmd_post(port->mcxnex_state, port_num,
	    MCXE_SET_PORT_GENERAL, sizeof (port_gen), 2,
	    &port_gen, DDI_SLEEP);
	if (ret != DDI_SUCCESS)
		return (DDI_FAILURE);

	ret = mcxe_set_rqpn_calc(port, 0);
	if (ret != DDI_SUCCESS)
		return (DDI_FAILURE);

	ret = mcxe_hw_mcast_setup(port);
	if (ret != DDI_SUCCESS)
		return (DDI_FAILURE);

	ret = mcxe_set_vlan_filter(port);
	if (ret != DDI_SUCCESS)
		return (DDI_FAILURE);

	ret = mcxnex_init_port_cmd_post(port->mcxnex_state,
	    port_num, DDI_SLEEP);
	if (ret != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_WARN,
		    "!mcxe%d: INIT_PORT (port %02d) command failed: %08x",
		    port->instance, port_num, ret);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}

