Arquivotheca/solaris11/usr/src/uts/common/io/mcxe/mcxe.c
/*
 * mcxe_free_txb_table()
 *	free tx buffer table
 */
static void
mcxe_free_txb_table(struct mcxe_tx_ring *tx_ring)
{
	mcxe_port_t *port;
	struct mcxe_txbuf *txb;
	int n, w;

	if (tx_ring->txbuf == NULL)
		return;

	mutex_enter(&tx_ring->tc_lock);
	port = tx_ring->port;
	for (n = 0; n < tx_ring->tx_buffers; n++) {
		txb = &tx_ring->txbuf[n];
		if (txb->num_sge) {
			for (w = 0; w < txb->num_dma_seg; w++) {
				(void) ddi_dma_unbind_handle(
				    txb->dma_handle_table[w]);
			}
			txb->num_dma_seg = 0;
			txb->num_sge = 0;
			txb->copy_len = 0;
			if (txb->mp) {
				freemsg(txb->mp);
				txb->mp = NULL;
			}
		}

		if (txb->dma_handle_table) {
			for (w = 0; w < port->max_tx_frags; w++) {
				if (txb->dma_handle_table[w]) {
					ddi_dma_free_handle(
					    &txb->dma_handle_table[w]);
					txb->dma_handle_table[w] = NULL;
				}
			}
			kmem_free(txb->dma_handle_table,
			    sizeof (ddi_dma_handle_t) *
			    port->max_tx_frags);
			txb->dma_handle_table = NULL;
		}

		if (txb->dma_frags) {
			kmem_free(txb->dma_frags,
			    sizeof (ibt_wr_ds_t) *
			    port->max_tx_frags);
			txb->dma_frags = NULL;
		}

		mcxe_free_dma_buffer(&txb->dma_buf);
	}

	kmem_free(tx_ring->txbuf, tx_ring->tx_buffers *
	    sizeof (struct mcxe_txbuf));
	tx_ring->txbuf = NULL;
	tx_ring->tx_buffers = 0;

	mutex_exit(&tx_ring->tc_lock);
}

/*
 * mcxe_alloc_txb_table()
 *	allocate tx buffer table
 */
static int
mcxe_alloc_txb_table(struct mcxe_tx_ring *tx_ring)
{
	mcxe_port_t *port = tx_ring->port;
	struct mcxe_txbuf *txb;
	int n, w, ret;

	tx_ring->tx_buffers = port->tx_ring_size;
	tx_ring->txbuf = kmem_zalloc(tx_ring->tx_buffers *
	    sizeof (struct mcxe_txbuf), KM_NOSLEEP);
	if (tx_ring->txbuf == NULL)
		return (DDI_FAILURE);

	for (n = 0; n < tx_ring->tx_buffers; n++) {
		txb = &tx_ring->txbuf[n];

		ret = mcxe_alloc_dma_buffer(port, &txb->dma_buf,
		    port->tx_buff_size);
		if (ret != DDI_SUCCESS)
			goto alloc_txb_fail;

		txb->dma_frags = kmem_zalloc(sizeof (ibt_wr_ds_t) *
		    port->max_tx_frags, KM_NOSLEEP);
		if (txb->dma_frags == NULL)
			goto alloc_txb_fail;

		txb->dma_handle_table = kmem_zalloc(
		    sizeof (ddi_dma_handle_t) *
		    port->max_tx_frags, KM_NOSLEEP);
		if (txb->dma_frags == NULL)
			goto alloc_txb_fail;

		for (w = 0; w < port->max_tx_frags; w++) {
			ret = ddi_dma_alloc_handle(port->devinfo,
			    &mcxe_dma_tx_attr,
			    DDI_DMA_DONTWAIT, NULL,
			    &txb->dma_handle_table[w]);
			if (ret != DDI_SUCCESS)
				goto alloc_txb_fail;
		}
	}
	tx_ring->tx_buffers_low = tx_ring->tx_buffers / 8;

	return (DDI_SUCCESS);

alloc_txb_fail:
	cmn_err(CE_WARN, "!mcxe%d: mcxe_alloc_txb_table() failed.\n",
	    port->instance);
	(void) mcxe_free_txb_table(tx_ring);

	return (DDI_FAILURE);
}

/*
 * mcxe_free_rxb_table()
 *	free rx buffer table
 */
static void
mcxe_free_rxb_table(struct mcxe_rx_ring *rx_ring)
{
	mcxe_port_t *port;
	struct mcxe_rxbuf *rxb;
	dma_buffer_t *dma_buf;
	int i;

	if (rx_ring->rxbuf == NULL)
		return;

	port = rx_ring->port;
	rw_enter(&rx_ring->rc_rwlock, RW_WRITER);
	for (i = 0; i < port->rx_ring_size; i++) {
		rxb = &rx_ring->rxbuf[i];
		if (rxb->ref_cnt) {	/* the rxb is in-use */
			if (mcxe_verbose) {
				cmn_err(CE_NOTE, "!mcxe%d: rxb %d is in use.\n",
				    port->instance, i);
			}
			atomic_inc_32(&port->rxb_pending);
			atomic_inc_32(&rx_ring->rxb_pending);
			rxb->flag |= MCXE_RXB_STOPPED;
			continue;
		}
		if (rxb->mp != NULL)
			freemsg(rxb->mp);
		dma_buf = &rxb->dma_buf;
		mcxe_free_dma_buffer(dma_buf);
	}
	rw_exit(&rx_ring->rc_rwlock);

	for (i = 0; rx_ring->rxb_pending && i < 10; i++) {
		/* wait for rxb to be freed ... */
		drv_usecwait(100);
	}

	rw_enter(&rx_ring->rc_rwlock, RW_WRITER);
	if (!rx_ring->rxb_pending && rx_ring->rxbuf) {
		kmem_free(rx_ring->rxbuf, port->rx_ring_size *
		    sizeof (struct mcxe_rxbuf));
		rx_ring->rxbuf = NULL;
	}
	rw_exit(&rx_ring->rc_rwlock);
}

/*
 * mcxe_alloc_rxb_table()
 *	alloc rx buffer table
 */
static int
mcxe_alloc_rxb_table(struct mcxe_rx_ring *rx_ring)
{
	mcxe_port_t *port = rx_ring->port;
	struct mcxe_rxbuf *rxb;
	dma_buffer_t *dma_buf;
	int i, ret;

	rw_enter(&rx_ring->rc_rwlock, RW_WRITER);
	if (rx_ring->rxbuf == NULL) {
		rx_ring->rxbuf = kmem_zalloc(port->rx_ring_size *
		    sizeof (struct mcxe_rxbuf), KM_NOSLEEP);
		if (rx_ring->rxbuf == NULL) {
			cmn_err(CE_WARN,
			    "!mcxe_alloc_rxb_table(): rxbuf alloc failed.");
			rw_exit(&rx_ring->rc_rwlock);
			return (DDI_FAILURE);
		}
	}

	for (i = 0; i < port->rx_ring_size; i++) {
		rxb = &rx_ring->rxbuf[i];
		if (rxb->ref_cnt) {	/* reuse the rxb */
			rxb->flag |= MCXE_RXB_REUSED;
			continue;
		}
		rxb->rx_ring = rx_ring;
		dma_buf = &rxb->dma_buf;
		ret = mcxe_alloc_dma_buffer(port, dma_buf,
		    port->rx_buff_size);
		if (ret != DDI_SUCCESS)
			goto alloc_rxb_fail;

		dma_buf->size -= MCXE_IPHDR_ALIGN_ROOM;
		dma_buf->address += MCXE_IPHDR_ALIGN_ROOM;
		dma_buf->dma_address += MCXE_IPHDR_ALIGN_ROOM;

		rxb->rxb_free_rtn.free_arg = (caddr_t)rxb;
		rxb->rxb_free_rtn.free_func = mcxe_rxb_free_cb;
		rxb->mp = desballoc((unsigned char *)dma_buf->address,
		    dma_buf->size, 0, &rxb->rxb_free_rtn);
	}
	rw_exit(&rx_ring->rc_rwlock);
	return (DDI_SUCCESS);

alloc_rxb_fail:
	rw_exit(&rx_ring->rc_rwlock);
	cmn_err(CE_WARN, "!mcxe%d: mcxe_alloc_rxb_table() failed.\n",
	    port->instance);
	mcxe_free_rxb_table(rx_ring);

	return (DDI_FAILURE);

}

/*
 * mcxe_free_tx_rsrc()
 *	free tx required resources including CQs, QPs and tx buffer table.
 */
static int
mcxe_free_tx_rsrc(struct mcxe_tx_ring *tx_ring)
{
	mcxe_port_t *port;
	mcxnex_qphdl_t qp_handle;
	ibc_qpn_hdl_t qpn_handle;
	mcxnex_cqhdl_t cq_handle;
	int ret;

	if (tx_ring == NULL)
		return (DDI_SUCCESS);
	port = tx_ring->port;

	/* free tx buffer table */
	mcxe_free_txb_table(tx_ring);

	/* free tx QP */
	qp_handle = tx_ring->tx_qp;
	if (qp_handle) {
		ret = mcxnex_qp_free(port->mcxnex_state, &qp_handle,
		    IBC_FREE_QP_AND_QPN, &qpn_handle,
		    DDI_NOSLEEP);
		if (ret != DDI_SUCCESS) {
			cmn_err(CE_WARN, "!mcxe%d: tx_qp free failed(ret=%d).",
			    port->instance, ret);
			goto free_tx_fail;
		}
		tx_ring->tx_qp = 0;
	}

