Arquivotheca/solaris11/usr/src/uts/common/io/mcxe/mcxe.c
	/* free tx CQ */
	cq_handle = tx_ring->tx_cq;
	if (cq_handle) {
		ret = mcxnex_cq_free(port->mcxnex_state, &cq_handle,
		    DDI_NOSLEEP);
		if (ret != DDI_SUCCESS) {
			cmn_err(CE_WARN, "!mcxe%d: tx_cq free failed(ret=%d).",
			    port->instance, ret);
			goto free_tx_fail;
		}
		tx_ring->tx_cq = 0;
	}

	return (DDI_SUCCESS);

free_tx_fail:
	cmn_err(CE_WARN, "!mcxe%d: mcxe_free_tx_rsrc() failed.\n",
	    port->instance);
	return (DDI_FAILURE);
}

/*
 * mcxe_alloc_tx_rsrc()
 *	allocate tx required resources including CQs, QPs and tx buffer table.
 */
static int
mcxe_alloc_tx_rsrc(struct mcxe_tx_ring *tx_ring)
{
	mcxe_port_t *port = tx_ring->port;
	ibt_cq_attr_t cq_attr;
	uint_t actual_size;
	int ret;

	/* allocate tx buffer table */
	ret = mcxe_alloc_txb_table(tx_ring);
	if (ret != DDI_SUCCESS)
		goto alloc_tx_fail;

	/* allocate tx CQ */
	cq_attr.cq_flags = 0;
	cq_attr.cq_sched = 0;
	cq_attr.cq_size = port->tx_ring_size;
	tx_ring->tx_cq = 0;
	ret = mcxnex_cq_alloc(port->mcxnex_state, NULL, &cq_attr,
	    &actual_size, &tx_ring->tx_cq, DDI_NOSLEEP);
	if (ret != DDI_SUCCESS) {
		cmn_err(CE_WARN,
		    "!mcxe_alloc_tx_rsrc(): alloc tx cq failed(ret=%d).", ret);
		goto alloc_tx_fail;
	}
	(void) mcxnex_cq_modify(port->mcxnex_state, tx_ring->tx_cq,
	    8, 0, 0, DDI_NOSLEEP);
	mcxnex_priv_cq_set_handler(port->mcxnex_state, tx_ring->tx_cq,
	    mcxe_tx_intr_handler, tx_ring);

	/* allocate tx QP */
	tx_ring->tx_qp = 0;
	ret = mcxe_alloc_tx_qp(tx_ring);
	if (ret != DDI_SUCCESS)
		goto alloc_tx_fail;

	return (DDI_SUCCESS);

alloc_tx_fail:
	cmn_err(CE_WARN, "!mcxe%d: mcxe_alloc_tx_rsrc() failed.\n",
	    port->instance);
	(void) mcxe_free_tx_rsrc(tx_ring);

	return (DDI_FAILURE);
}

/*
 * mcxe_free_rx_rsrc()
 *	free rx required resources including CQs, QPs and rx buffer table.
 */
static int
mcxe_free_rx_rsrc(struct mcxe_rx_ring *rx_ring)
{
	mcxe_port_t *port;
	mcxnex_qphdl_t qp_handle;
	ibc_qpn_hdl_t qpn_handle;
	mcxnex_cqhdl_t cq_handle;
	int ret;

	if (rx_ring == NULL)
		return (DDI_SUCCESS);

	if (rx_ring->rxbuf)
		mcxe_free_rxb_table(rx_ring);

	port = rx_ring->port;
	qp_handle = rx_ring->rx_qp;
	if (qp_handle) {
		ret = mcxnex_qp_free(port->mcxnex_state, &qp_handle,
		    IBC_FREE_QP_AND_QPN, &qpn_handle,
		    DDI_NOSLEEP);
		if (ret != DDI_SUCCESS) {
			cmn_err(CE_WARN, "!mcxe%d: free rx_qp failed(ret=%d).",
			    port->instance, ret);
			goto free_rx_fail;
		}
		rx_ring->rx_qp = 0;
	}

	cq_handle = rx_ring->rx_cq;
	if (cq_handle) {
		ret = mcxnex_cq_free(port->mcxnex_state, &cq_handle,
		    DDI_NOSLEEP);
		if (ret != DDI_SUCCESS) {
			cmn_err(CE_WARN, "!mcxe%d: free rx_cq failed(ret=%d).",
			    port->instance, ret);
			goto free_rx_fail;
		}
		rx_ring->rx_cq = 0;
	}

	return (DDI_SUCCESS);

free_rx_fail:
	cmn_err(CE_WARN, "!mcxe%d: mcxe_free_rx_rsrc() failed.\n",
	    port->instance);

	return (DDI_FAILURE);
}

/*
 * mcxe_alloc_rx_rsrc()
 *	allocate rx required resources including CQs, QPs and rx buffer table.
 */
static int
mcxe_alloc_rx_rsrc(struct mcxe_rx_ring *rx_ring)
{
	mcxe_port_t *port = rx_ring->port;
	ibt_cq_attr_t cq_attr;
	uint_t actual_size;
	int ret;

	/* allocate rx buffer table */
	ret = mcxe_alloc_rxb_table(rx_ring);
	if (ret != DDI_SUCCESS)
		goto alloc_rx_fail;

	/* allocate rx CQ */
	cq_attr.cq_flags = 0;
	cq_attr.cq_sched = 0;
	cq_attr.cq_size = port->rx_ring_size;
	ret = mcxnex_cq_alloc(port->mcxnex_state, NULL, &cq_attr,
	    &actual_size, &rx_ring->rx_cq, DDI_NOSLEEP);
	if (ret != DDI_SUCCESS) {
		cmn_err(CE_WARN,
		    "!mcxe_alloc_rx_rsrc(): alloc rx cq failed(ret=%d).", ret);
		goto alloc_rx_fail;
	}
	mcxnex_priv_cq_set_handler(port->mcxnex_state, rx_ring->rx_cq,
	    mcxe_rx_intr_handler, rx_ring);

	/* allocate rx QP */
	ret = mcxe_alloc_rx_qp(rx_ring);
	if (ret != DDI_SUCCESS)
		goto alloc_rx_fail;

	return (DDI_SUCCESS);

alloc_rx_fail:
	cmn_err(CE_WARN, "!mcxe%d: mcxe_alloc_rx_rsrc() failed.\n",
	    port->instance);
	(void) mcxe_free_rx_rsrc(rx_ring);
	return (DDI_FAILURE);
}

/*
 * mcxe_free_rsrc()
 *	free port rx/tx resources.
 */
static void
mcxe_free_rsrc(mcxe_port_t *port)
{
	int i;

	for (i = 0; i < port->num_rx_rings; i++)
		(void) mcxe_free_rx_rsrc(&port->rx_rings[i]);

	for (i = 0; i < port->num_tx_rings; i++)
		(void) mcxe_free_tx_rsrc(&port->tx_rings[i]);

	port->progress &= ~MCXE_PRG_ALLOC_RSRC;
}

/*
 * mcxe_alloc_rsrc()
 *	allocate port rx/tx resources.
 */
static int
mcxe_alloc_rsrc(mcxe_port_t *port)
{
	struct mcxe_tx_ring *tx_ring;
	struct mcxe_rx_ring *rx_ring;
	int i, ret;

	if (port->progress & MCXE_PRG_ALLOC_RSRC)
		return (DDI_SUCCESS);

	/* allocate tx resource */
	for (i = 0; i < port->num_tx_rings; i++) {
		tx_ring = &port->tx_rings[i];
		ret = mcxe_alloc_tx_rsrc(tx_ring);
		if (ret != DDI_SUCCESS)
			goto alloc_rsrc_fail;
	}

	/* allocate rx resource */
	for (i = 0; i < port->num_rx_rings; i++) {
		rx_ring = &port->rx_rings[i];
		ret = mcxe_alloc_rx_rsrc(rx_ring);
		if (ret != DDI_SUCCESS)
			goto alloc_rsrc_fail;
	}

	port->progress |= MCXE_PRG_ALLOC_RSRC;

	return (DDI_SUCCESS);

alloc_rsrc_fail:
	cmn_err(CE_WARN, "!mcxe%d: mcxe_alloc_rsrc() failed.\n",
	    port->instance);
	mcxe_free_rsrc(port);

	return (DDI_FAILURE);
}

/*
 * mcxe_init_rx_ring()
 *	initialize the rx ring structure.
 */
static void
mcxe_init_rx_ring(struct mcxe_rx_ring *rx_ring)
{
	int i;
	struct mcxe_rxbuf *rxb;

	mutex_enter(&rx_ring->rx_lock);
	rw_enter(&rx_ring->rc_rwlock, RW_WRITER);

	rx_ring->rx_free = 0;
	rx_ring->rx_bind = 0;
	rx_ring->rx_bcopy = 0;
	rx_ring->rx_postfail = 0;
	rx_ring->rx_allocfail = 0;

	/* fill in Rx QP */
	for (i = 0; i < rx_ring->port->rx_ring_size; i++) {
		rxb = &rx_ring->rxbuf[i];
		rxb->index = i;
		if (rxb->ref_cnt) {
			if (rxb->flag & MCXE_RXB_REUSED)
				rxb->flag |= MCXE_RXB_STARTED;
		} else {
			rxb->flag = 0;
			(void) mcxe_post_recv(rxb);
		}
	}

	rw_exit(&rx_ring->rc_rwlock);
	mutex_exit(&rx_ring->rx_lock);
}

/*
 * mcxe_init_tx_ring()
 *	initialize the tx ring structure.
 */
static void
mcxe_init_tx_ring(struct mcxe_tx_ring *tx_ring)
{
	mcxe_queue_t *txbuf_queue;
	mcxe_queue_item_t *txbuf_head;
	mcxe_txbuf_t *txbuf;
	uint32_t slot;

	mutex_enter(&tx_ring->tc_lock);

