Arquivotheca/solaris11/usr/src/uts/common/io/mcxe/mcxe.c
	/*
	 * Reinitialise control variables ...
	 */
	tx_ring->tx_nobd = 0;
	tx_ring->tx_nobuf = 0;
	tx_ring->tx_bindfail = 0;
	tx_ring->tx_bindexceed = 0;
	tx_ring->tx_alloc_fail = 0;
	tx_ring->tx_pullup = 0;
	tx_ring->tx_drop = 0;
	tx_ring->tx_bcopy = 0;
	tx_ring->tx_free = tx_ring->tx_buffers;

	/*
	 * Initialize the tx buffer push queue
	 */
	mutex_enter(&tx_ring->freetxbuf_lock);
	mutex_enter(&tx_ring->txbuf_lock);
	txbuf_queue = &tx_ring->freetxbuf_queue;
	txbuf_queue->head = NULL;
	txbuf_queue->count = 0;
	txbuf_queue->lock = &tx_ring->freetxbuf_lock;
	tx_ring->txbuf_push_queue = txbuf_queue;

	/*
	 * Initialize the tx buffer pop queue
	 */
	txbuf_queue = &tx_ring->txbuf_queue;
	txbuf_queue->head = NULL;
	txbuf_queue->count = 0;
	txbuf_queue->lock = &tx_ring->txbuf_lock;
	tx_ring->txbuf_pop_queue = txbuf_queue;
	txbuf_head = tx_ring->txbuf_head;
	txbuf = tx_ring->txbuf;
	for (slot = 0; slot < tx_ring->tx_buffers; ++slot) {
		txbuf_head->item = txbuf;
		txbuf_head->next = txbuf_queue->head;
		txbuf_queue->head = txbuf_head;
		txbuf_queue->count++;
		txbuf++;
		txbuf_head++;
	}
	mutex_exit(&tx_ring->txbuf_lock);
	mutex_exit(&tx_ring->freetxbuf_lock);

	mutex_exit(&tx_ring->tc_lock);
}

/*
 * mcxe_start_rings()
 *	enable QPs for tx/rx rings.
 */
static int
mcxe_start_rings(struct mcxe_port *port)
{
	int ret, i;
	struct mcxe_rx_ring *rx_ring;
	struct mcxe_tx_ring *tx_ring;

	for (i = 0; i < port->num_tx_rings; i++) {
		tx_ring = &port->tx_rings[i];
		ret = mcxe_enable_qp(port, tx_ring->tx_qp);
		if (ret != DDI_SUCCESS) {
			cmn_err(CE_WARN,
			    "!mcxe_start_rings: enable tx ring %d failed.", i);
			return (DDI_FAILURE);
		}
		(void) mcxnex_cq_notify(port->mcxnex_state, tx_ring->tx_cq,
		    IBT_NEXT_COMPLETION);

		mcxe_init_tx_ring(tx_ring);
	}

	for (i = 0; i < port->num_rx_rings; i++) {
		rx_ring = &port->rx_rings[i];
		ret = mcxe_enable_qp(port, rx_ring->rx_qp);
		if (ret != DDI_SUCCESS) {
			cmn_err(CE_WARN,
			    "!mcxe_start_rings: enable rx ring %d failed.", i);
			return (DDI_FAILURE);
		}

		(void) mcxnex_cq_notify(port->mcxnex_state, rx_ring->rx_cq,
		    IBT_NEXT_COMPLETION);

		mcxe_init_rx_ring(rx_ring);
	}

	return (DDI_SUCCESS);
}

/*
 * mcxe_stop_rings()
 */
static int
mcxe_stop_rings(struct mcxe_port *port)
{
	struct mcxe_rx_ring *rx_ring;
	int ret, i;

	for (i = 0; i < port->num_rx_rings; i++) {
		rx_ring = &port->rx_rings[i];
		mutex_enter(&rx_ring->rx_lock);
		rw_enter(&rx_ring->rc_rwlock, RW_WRITER);
		ret = mcxe_disable_qp(port, rx_ring->rx_qp);
		rw_exit(&rx_ring->rc_rwlock);
		mutex_exit(&rx_ring->rx_lock);

		if (ret != DDI_SUCCESS)
			return (DDI_FAILURE);

	}

	return (DDI_SUCCESS);
}


/*
 * ====== GLD-required entry points ======
 */

/*
 * mcxe_m_tx() - send a chain of packets
 */
mblk_t *
mcxe_m_tx(void *arg, mblk_t *mp)
{
	mblk_t *next;
	mcxe_port_t *port = arg;

	ASSERT(mp != NULL);

	rw_enter(&port->port_rwlock, RW_READER);

	while (mp != NULL) {
		next = mp->b_next;
		mp->b_next = NULL;

		if ((mp = mcxe_tx(arg, mp)) != NULL) {
			mp->b_next = next;
			break;
		}
		mp = next;
	}

	rw_exit(&port->port_rwlock);

	return (mp);
}

static int
mcxe_m_stat(void *arg, uint_t stat, uint64_t *val)
{
	mcxe_port_t *port = arg;
	struct mcxe_hw_stats *hw_statsp;

	mutex_enter(&port->port_lock);

	if (!(port->if_state & MCXE_IF_STARTED)) {
		mutex_exit(&port->port_lock);
		return (ECANCELED);
	}

	(void) mcxe_hw_get_stats(port, 0);

	hw_statsp = &port->hw_stats;
	switch (stat) {
	case MAC_STAT_IFSPEED:
		*val = port->link_speed * 1000000ull;
		break;

	case MAC_STAT_MULTIRCV:
		*val = hw_statsp->MCAST_prio_0 + hw_statsp->MCAST_prio_1 +
		    hw_statsp->MCAST_prio_2 + hw_statsp->MCAST_prio_3 +
		    hw_statsp->MCAST_prio_4 + hw_statsp->MCAST_prio_5 +
		    hw_statsp->MCAST_prio_6 + hw_statsp->MCAST_prio_7 +
		    hw_statsp->MCAST_novlan;
		break;

	case MAC_STAT_BRDCSTRCV:
		*val = hw_statsp->RBCAST_prio_0 + hw_statsp->RBCAST_prio_1 +
		    hw_statsp->RBCAST_prio_2 + hw_statsp->RBCAST_prio_3 +
		    hw_statsp->RBCAST_prio_4 + hw_statsp->RBCAST_prio_5 +
		    hw_statsp->RBCAST_prio_6 + hw_statsp->RBCAST_prio_7 +
		    hw_statsp->RBCAST_novlan;
		break;

	case MAC_STAT_MULTIXMT:
		*val = hw_statsp->TMCAST_prio_0 + hw_statsp->TMCAST_prio_1 +
		    hw_statsp->TMCAST_prio_2 + hw_statsp->TMCAST_prio_3 +
		    hw_statsp->TMCAST_prio_4 + hw_statsp->TMCAST_prio_5 +
		    hw_statsp->TMCAST_prio_6 + hw_statsp->TMCAST_prio_7 +
		    hw_statsp->TMCAST_novlan;
		break;

	case MAC_STAT_BRDCSTXMT:
		*val = hw_statsp->TBCAST_prio_0 + hw_statsp->TBCAST_prio_1 +
		    hw_statsp->TBCAST_prio_2 + hw_statsp->TBCAST_prio_3 +
		    hw_statsp->TBCAST_prio_4 + hw_statsp->TBCAST_prio_5 +
		    hw_statsp->TBCAST_prio_6 + hw_statsp->TBCAST_prio_7 +
		    hw_statsp->TBCAST_novlan;
		break;

	case MAC_STAT_NORCVBUF:
		*val = hw_statsp->RdropOvflw;
		break;

	case MAC_STAT_IERRORS:
		*val = hw_statsp->PCS + hw_statsp->RJBBR +
		    hw_statsp->RCRC + hw_statsp->RRUNT;
		break;

	case MAC_STAT_RBYTES:
		*val = hw_statsp->ROCT_prio_0 + hw_statsp->ROCT_prio_1 +
		    hw_statsp->ROCT_prio_2 + hw_statsp->ROCT_prio_3 +
		    hw_statsp->ROCT_prio_4 + hw_statsp->ROCT_prio_5 +
		    hw_statsp->ROCT_prio_6 + hw_statsp->ROCT_prio_7 +
		    hw_statsp->ROCT_novlan;
		break;

	case MAC_STAT_OBYTES:
		*val = hw_statsp->TOCT_prio_0 + hw_statsp->TOCT_prio_1 +
		    hw_statsp->TOCT_prio_2 + hw_statsp->TOCT_prio_3 +
		    hw_statsp->TOCT_prio_4 + hw_statsp->TOCT_prio_5 +
		    hw_statsp->TOCT_prio_6 + hw_statsp->TOCT_prio_7 +
		    hw_statsp->TOCT_novlan;
		break;

	case MAC_STAT_IPACKETS:
		*val = hw_statsp->RTOT_prio_0 + hw_statsp->RTOT_prio_1 +
		    hw_statsp->RTOT_prio_2 + hw_statsp->RTOT_prio_3 +
		    hw_statsp->RTOT_prio_4 + hw_statsp->RTOT_prio_5 +
		    hw_statsp->RTOT_prio_6 + hw_statsp->RTOT_prio_7 +
		    hw_statsp->RTOT_novlan;
		break;

	case MAC_STAT_OPACKETS:
		*val = hw_statsp->TTOT_prio_0 + hw_statsp->TTOT_prio_1 +
		    hw_statsp->TTOT_prio_2 + hw_statsp->TTOT_prio_3 +
		    hw_statsp->TTOT_prio_4 + hw_statsp->TTOT_prio_5 +
		    hw_statsp->TTOT_prio_6 + hw_statsp->TTOT_prio_7 +
		    hw_statsp->TTOT_novlan;
		break;

