Arquivotheca/solaris11/usr/src/uts/common/io/mcxe/mcxe.c
	case ETHER_STAT_FCS_ERRORS:
		*val = hw_statsp->RCRC;
		break;

	case ETHER_STAT_TOOLONG_ERRORS:
		*val = hw_statsp->RGIANT_prio_0 + hw_statsp->RGIANT_prio_1 +
		    hw_statsp->RGIANT_prio_2 + hw_statsp->RGIANT_prio_3 +
		    hw_statsp->RGIANT_prio_4 + hw_statsp->RGIANT_prio_5 +
		    hw_statsp->RGIANT_prio_6 + hw_statsp->RGIANT_prio_7 +
		    hw_statsp->RGIANT_novlan;
		break;

	case ETHER_STAT_MACRCV_ERRORS:
		*val = hw_statsp->RDROP;
		break;

	/* MII/GMII stats */
	case ETHER_STAT_XCVR_ADDR:
		*val = 1;
		break;

	case ETHER_STAT_XCVR_ID:
		*val = 1;
		break;

	case ETHER_STAT_XCVR_INUSE:
		*val = 1;
		break;

	case ETHER_STAT_CAP_10GFDX:
		*val = 1;
		break;

	case ETHER_STAT_CAP_1000FDX:
		*val = 1;
		break;

	case ETHER_STAT_CAP_100FDX:
		*val = 0;
		break;

	case ETHER_STAT_CAP_ASMPAUSE:
		*val = port->param_asym_pause_cap;
		break;

	case ETHER_STAT_CAP_PAUSE:
		*val = port->param_pause_cap;
		break;
	case ETHER_STAT_CAP_AUTONEG:
		*val = 1;
		break;

	case ETHER_STAT_ADV_CAP_10GFDX:
		*val = port->param_adv_10000fdx_cap;
		break;

	case ETHER_STAT_ADV_CAP_1000FDX:
		*val = port->param_adv_1000fdx_cap;
		break;

	case ETHER_STAT_ADV_CAP_100FDX:
		*val = port->param_adv_100fdx_cap;
		break;

	case ETHER_STAT_ADV_CAP_ASMPAUSE:
		*val = port->param_adv_asym_pause_cap;
		break;

	case ETHER_STAT_ADV_CAP_PAUSE:
		*val = port->param_adv_pause_cap;
		break;

	case ETHER_STAT_ADV_CAP_AUTONEG:
		*val = port->param_adv_autoneg_cap;
		break;

	case ETHER_STAT_LP_CAP_10GFDX:
		*val = port->param_lp_10000fdx_cap;
		break;

	case ETHER_STAT_LP_CAP_1000FDX:
		*val = port->param_lp_1000fdx_cap;
		break;

	case ETHER_STAT_LP_CAP_100FDX:
		*val = port->param_lp_100fdx_cap;
		break;

	case ETHER_STAT_LP_CAP_ASMPAUSE:
		*val = port->param_lp_asym_pause_cap;
		break;

	case ETHER_STAT_LP_CAP_PAUSE:
		*val = port->param_lp_pause_cap;
		break;

	case ETHER_STAT_LP_CAP_AUTONEG:
		*val = port->param_lp_autoneg_cap;
		break;

	case ETHER_STAT_LINK_ASMPAUSE:
		*val = port->param_asym_pause_cap;
		break;

	case ETHER_STAT_LINK_PAUSE:
		*val = port->param_pause_cap;
		break;

	case ETHER_STAT_LINK_AUTONEG:
		*val = port->param_adv_autoneg_cap;
		break;

	case ETHER_STAT_LINK_DUPLEX:
		*val = port->link_duplex;
		break;

	case ETHER_STAT_TOOSHORT_ERRORS:
		*val = hw_statsp->RSHORT;
		break;

	case ETHER_STAT_CAP_REMFAULT:
		*val = port->param_rem_fault;
		break;

	case ETHER_STAT_ADV_REMFAULT:
		*val = port->param_adv_rem_fault;
		break;

	case ETHER_STAT_LP_REMFAULT:
		*val = port->param_lp_rem_fault;
		break;

	case ETHER_STAT_JABBER_ERRORS:
		*val = hw_statsp->RJBBR;
		break;

	default:
		mutex_exit(&port->port_lock);
		return (ENOTSUP);
	}

	mutex_exit(&port->port_lock);

	return (0);
}

static int
mcxe_m_start(void *arg)
{
	mcxe_port_t *port = arg;
	int ret;

	mutex_enter(&port->port_lock);
	rw_enter(&port->port_rwlock, RW_WRITER);

	ret = mcxe_alloc_rsrc(port);
	if (ret != DDI_SUCCESS)
		goto alloc_fail;

	ret = mcxe_start_rings(port);
	if (ret != DDI_SUCCESS)
		goto start_fail;

	/* add the primary MAC address to MAC address table */
	ret = mcxe_set_primary_mac(port, port->hw_mac);
	if (ret != DDI_SUCCESS)
		goto start_fail;

	/* init and start the port */
	ret = mcxe_init_port(port);
	if (ret != DDI_SUCCESS)
		goto start_fail;
	atomic_or_32(&port->if_state, MCXE_IF_STARTED);

	/* clear the statistics */
	(void) mcxe_hw_get_stats(port, 1);
	bzero(&port->hw_stats, sizeof (struct mcxe_hw_stats));

	rw_exit(&port->port_rwlock);
	mutex_exit(&port->port_lock);

	if (mcxe_verbose) {
		cmn_err(CE_NOTE, "!mcxe%d: mcxe_m_start() OK.\n",
		    port->instance);
	}

	return (DDI_SUCCESS);

start_fail:
	mcxe_free_rsrc(port);

alloc_fail:
	rw_exit(&port->port_rwlock);
	mutex_exit(&port->port_lock);

	cmn_err(CE_WARN, "!mcxe%d: mcxe_m_start() failed.\n",
	    port->instance);

	return (ret);
}

static void
mcxe_m_stop(void *arg)
{
	int ret;
	mcxe_port_t *port = arg;

	mutex_enter(&port->port_lock);
	atomic_and_32(&port->if_state, ~MCXE_IF_STARTED);
	port->link_state = LINK_STATE_UNKNOWN;
	mac_link_update(port->mac_hdl, port->link_state);
	ret = mcxe_hw_ucast_cleanup(port);
	if (ret != DDI_SUCCESS) {
		cmn_err(CE_WARN, "!mcxe_m_stop: ucast cleanup failed");
	}
	(void) mcxe_hw_disable_promisc(port);

	rw_enter(&port->port_rwlock, RW_WRITER);
	drv_usecwait(1500);	/* drain hw rx/tx */
	ret = mcxe_stop_rings(port);
	if (ret != DDI_SUCCESS) {
		cmn_err(CE_WARN, "!mcxe_m_stop: stop rings failed");
	}
	ret = mcxnex_close_port_cmd_post(port->mcxnex_state,
	    port->phys_port_num, DDI_SLEEP);
	if (ret != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_WARN, "!mcxe%d: failed to close port %x",
		    port->instance, port->phys_port_num);
	}
	rw_exit(&port->port_rwlock);

	mcxe_free_rsrc(port);
	mutex_exit(&port->port_lock);
}

static int
mcxe_m_promisc(void *arg, boolean_t on)
{
	int ret;
	mcxe_port_t *port = arg;

	mutex_enter(&port->port_lock);
	if (!(port->if_state & MCXE_IF_STARTED)) {
		mutex_exit(&port->port_lock);
		return (0);
	}

	if (on)
		ret = mcxe_hw_enable_promisc(port);
	else
		ret = mcxe_hw_disable_promisc(port);

	mutex_exit(&port->port_lock);

	return (ret);
}

static int
mcxe_m_multicst(void *arg, boolean_t add, const uint8_t *mcast_addr)
{
	mcxe_port_t *port = arg;
	int ret;

	mutex_enter(&port->port_lock);
	if (!(port->if_state & MCXE_IF_STARTED)) {
		mutex_exit(&port->port_lock);
		return (0);
	}

	if (add)
		ret = mcxe_mcast_add(port, mcast_addr);
	else
		ret = mcxe_mcast_del(port, mcast_addr);

	mutex_exit(&port->port_lock);

	return (ret);
}

static int
mcxe_m_unicst(void *arg, const uint8_t *mac_addr)
{
	struct mcxe_port *port = arg;
	uint64_t hw_mac = 0;
	int ret;

	mutex_enter(&port->port_lock);
	if (!(port->if_state & MCXE_IF_STARTED)) {
		mutex_exit(&port->port_lock);
		return (0);
	}

	bcopy(mac_addr, ((uint8_t *)&hw_mac) + 2, ETHERADDRL);
	ret = mcxe_set_primary_mac(port, hw_mac);

	mutex_exit(&port->port_lock);

	return (ret);
}

/*ARGSUSED*/
static boolean_t
mcxe_m_getcapab(void *arg, mac_capab_t cap, void *cap_data)
{
	switch (cap) {
	case MAC_CAPAB_HCKSUM: {
		uint32_t *txflags = cap_data;

		*txflags = HCKSUM_INET_FULL_V4 | HCKSUM_IPHDRCKSUM;
		break;
	}
	case MAC_CAPAB_LSO: {
		mac_capab_lso_t *cap_lso = cap_data;

