Arquivotheca/solaris11/usr/src/uts/common/io/mcxe/mcxe.c
		cap_lso->lso_flags = LSO_TX_BASIC_TCP_IPV4;
		cap_lso->lso_basic_tcp_ipv4.lso_max = MCXE_LSO_MAXLEN;
		break;
	}
	default:
		return (B_FALSE);
	}

	return (B_TRUE);
}

/*ARGSUSED*/
static int
mcxe_m_setprop(void *arg, const char *pr_name, mac_prop_id_t pr_num,
    uint_t pr_valsize, const void *pr_val)
{
	mcxe_port_t *port = arg;
	uint32_t cur_mtu, new_mtu;
	int err;

	mutex_enter(&port->port_lock);

	switch (pr_num) {
	case MAC_PROP_EN_10GFDX_CAP:
	case MAC_PROP_EN_1000FDX_CAP:
	case MAC_PROP_EN_100FDX_CAP:
	case MAC_PROP_AUTONEG:
	case MAC_PROP_FLOWCTRL:
	case MAC_PROP_ADV_10GFDX_CAP:
	case MAC_PROP_ADV_1000FDX_CAP:
	case MAC_PROP_ADV_100FDX_CAP:
	case MAC_PROP_STATUS:
	case MAC_PROP_SPEED:
	case MAC_PROP_DUPLEX:
		err = ENOTSUP; /* read-only prop. Can't set this. */
		break;

	case MAC_PROP_MTU:
		cur_mtu = port->default_mtu;
		bcopy(pr_val, &new_mtu, sizeof (new_mtu));
		if (new_mtu == cur_mtu) {
			err = 0;
			break;
		}

		if (new_mtu < MCXE_DEFAULT_MTU || new_mtu > MCXE_MAX_MTU) {
			err = EINVAL;
			break;
		}

		if (port->if_state & MCXE_IF_STARTED) {
			err = EBUSY;
			break;
		}

		err = mac_maxsdu_update(port->mac_hdl, new_mtu);
		if (err == 0) {
			/*
			 * Set rx/tx buffer size
			 */
			port->default_mtu = new_mtu;
			port->max_frame_size = port->default_mtu +
			    sizeof (struct ether_vlan_header) + ETHERFCSL;
			port->rx_buff_size = port->max_frame_size +
			    MCXE_IPHDR_ALIGN_ROOM;
			port->rx_buff_size = (port->rx_buff_size + 0x3ff) &
			    (~0x3ff); /* 1K alligned */
			port->tx_buff_size = port->rx_buff_size;
		}
		break;

	default:
		err = EINVAL;
		break;
	}

	mutex_exit(&port->port_lock);
	return (err);
}

/*ARGSUSED*/
static int
mcxe_m_getprop(void *arg, const char *pr_name, mac_prop_id_t pr_num,
    uint_t pr_valsize, void *pr_val)
{
	mcxe_port_t *port = arg;
	uint32_t flow_control;
	uint64_t tmp = 0;
	int err = 0;

	switch (pr_num) {
	case MAC_PROP_DUPLEX:
		ASSERT(pr_valsize >= sizeof (link_duplex_t));
		bcopy(&port->link_duplex, pr_val,
		    sizeof (link_duplex_t));
		break;
	case MAC_PROP_SPEED:
		ASSERT(pr_valsize >= sizeof (uint64_t));
		tmp = port->link_speed * 1000000ull;
		bcopy(&tmp, pr_val, sizeof (tmp));
		break;
	case MAC_PROP_AUTONEG:
		*(uint8_t *)pr_val = port->param_adv_autoneg_cap;
		break;
	case MAC_PROP_FLOWCTRL:
		ASSERT(pr_valsize >= sizeof (uint32_t));
		flow_control = LINK_FLOWCTRL_NONE;
		bcopy(&flow_control, pr_val, sizeof (flow_control));
		break;
	case MAC_PROP_ADV_10GFDX_CAP:
		*(uint8_t *)pr_val = port->param_adv_10000fdx_cap;
		break;
	case MAC_PROP_EN_10GFDX_CAP:
		*(uint8_t *)pr_val = port->param_en_10000fdx_cap;
		break;
	case MAC_PROP_ADV_1000FDX_CAP:
		*(uint8_t *)pr_val = port->param_adv_1000fdx_cap;
		break;
	case MAC_PROP_EN_1000FDX_CAP:
		*(uint8_t *)pr_val = port->param_en_1000fdx_cap;
		break;
	case MAC_PROP_ADV_100FDX_CAP:
		*(uint8_t *)pr_val = port->param_adv_100fdx_cap;
		break;
	case MAC_PROP_EN_100FDX_CAP:
		*(uint8_t *)pr_val = port->param_en_100fdx_cap;
		break;
	default:
		err = EINVAL;
		break;
	}
	return (err);
}

/*ARGSUSED*/
static void
mcxe_m_propinfo(void *arg, const char *pr_name, mac_prop_id_t pr_num,
    mac_prop_info_handle_t prh)
{
	switch (pr_num) {
	case MAC_PROP_DUPLEX:
	case MAC_PROP_SPEED:
	case MAC_PROP_ADV_100FDX_CAP:
	case MAC_PROP_ADV_1000FDX_CAP:
	case MAC_PROP_ADV_10GFDX_CAP:
	case MAC_PROP_AUTONEG:
	case MAC_PROP_EN_10GFDX_CAP:
	case MAC_PROP_EN_1000FDX_CAP:
	case MAC_PROP_EN_100FDX_CAP:
	case MAC_PROP_FLOWCTRL:
		mac_prop_info_set_perm(prh, MAC_PROP_PERM_READ);
		break;

	case MAC_PROP_MTU:
		mac_prop_info_set_range_uint32(prh, MCXE_DEFAULT_MTU,
		    MCXE_MAX_MTU);
		break;
	default:
		break;
	}
}

#define	MCXE_MAC_CALLBACK_FLAGS \
	(MC_GETCAPAB | MC_SETPROP | MC_GETPROP | MC_PROPINFO)

static mac_callbacks_t mcxe_mac_callbacks = {
	MCXE_MAC_CALLBACK_FLAGS,
	mcxe_m_stat,
	mcxe_m_start,
	mcxe_m_stop,
	mcxe_m_promisc,
	mcxe_m_multicst,
	mcxe_m_unicst,
	mcxe_m_tx,
	NULL,
	NULL,
	mcxe_m_getcapab,
	NULL,
	NULL,
	mcxe_m_setprop,
	mcxe_m_getprop,
	mcxe_m_propinfo
};


/*
 * ====== module initialization support functions ======
 */
static void
mcxe_init_link_params(mcxe_port_t *port)
{
	port->param_en_10000fdx_cap = 1;
	port->param_en_1000fdx_cap = 1;
	port->param_en_100fdx_cap = 0;
	port->param_adv_10000fdx_cap = 1;
	port->param_adv_1000fdx_cap = 1;
	port->param_adv_100fdx_cap = 0;

	port->param_pause_cap = 1;
	port->param_asym_pause_cap = 1;
	port->param_rem_fault = 0;

	port->param_adv_autoneg_cap = 1;
	port->param_adv_pause_cap = 1;
	port->param_adv_asym_pause_cap = 1;
	port->param_adv_rem_fault = 0;

	port->param_lp_10000fdx_cap = 0;
	port->param_lp_1000fdx_cap = 0;
	port->param_lp_100fdx_cap = 0;
	port->param_lp_autoneg_cap = 0;
	port->param_lp_pause_cap = 0;
	port->param_lp_asym_pause_cap = 0;
	port->param_lp_rem_fault = 0;
}

static int
mcxe_get_conf_prop(mcxe_port_t *port,
    char *propname,	/* name of the property */
    int minval,		/* minimum acceptable value */
    int maxval,		/* maximim acceptable value */
    int defval)		/* default value */
{
	int value;

	/*
	 * Call ddi_prop_get_int() to read the conf settings
	 */
	value = ddi_prop_get_int(DDI_DEV_T_ANY, port->devinfo,
	    DDI_PROP_DONTPASS, propname, defval);

	if (value > maxval)
		value = maxval;

	if (value < minval)
		value = minval;

	return (value);
}

/*
 * mcxe_get_drv_conf - Get driver configurations set in mcxe.conf
 */
static void
mcxe_get_drv_conf(mcxe_port_t *port)
{
	/*
	 * Jumbo frame configuration:
	 *    default_mtu
	 */
	port->default_mtu = mcxe_get_conf_prop(port, PROP_DEFAULT_MTU,
	    ETHERMIN, MCXE_MAX_MTU, MCXE_DEFAULT_MTU);
}

/*
 * mcxe_create_profile()
 */
static void
mcxe_create_profile(mcxe_port_t *port)
{
	uint32_t max_rx_size;

	port->num_tx_rings = MCXE_TX_RING_NUM;
	port->num_rx_rings = MCXE_RX_RING_NUM;
	port->rx_ring_size = MCXE_RX_SLOTS;
	port->tx_ring_size = MCXE_TX_SLOTS;
	port->max_tx_frags = MCXE_MAX_FRAGS;
	port->tx_copy_thresh = 512;
	port->rx_copy_thresh = 256;
	port->max_frame_size = port->default_mtu +
	    sizeof (struct ether_vlan_header) + ETHERFCSL;

