Arquivotheca/solaris11/usr/src/uts/common/io/mcxe/mcxe.c
	/*
	 * Set rx buffer size
	 */
	max_rx_size = port->max_frame_size + MCXE_IPHDR_ALIGN_ROOM;
	port->rx_buff_size = (max_rx_size + 0x3ff) & (~0x3ff); /* 1K alligned */
	port->tx_buff_size = port->rx_buff_size;

	mcxe_init_link_params(port);
}

/*
 * mcxe_free_rings()
 */
static void
mcxe_free_rings(mcxe_port_t *port)
{
	struct mcxe_tx_ring *tx_ring;
	struct mcxe_rx_ring *rx_ring;
	int i;

	if (port->tx_rings) {
		for (i = 0; i < port->num_tx_rings; i++) {
			tx_ring = &port->tx_rings[i];
			mutex_destroy(&tx_ring->tc_lock);
			mutex_destroy(&tx_ring->freetxbuf_lock);
			mutex_destroy(&tx_ring->txbuf_lock);
			if (tx_ring->txbuf_head) {
				kmem_free(tx_ring->txbuf_head,
				    MCXE_TX_SLOTS * sizeof (mcxe_queue_item_t));
				tx_ring->txbuf_head = NULL;
			}
		}

		kmem_free(port->tx_rings, MCXE_TX_RING_MAX *
		    sizeof (struct mcxe_tx_ring));
		port->tx_rings = NULL;
	}

	if (port->rx_rings) {
		for (i = 0; i < port->num_rx_rings; i++) {
			rx_ring = &port->rx_rings[i];
			rw_destroy(&rx_ring->rc_rwlock);
			mutex_destroy(&rx_ring->rx_lock);
		}

		kmem_free(port->rx_rings, MCXE_RX_RING_MAX *
		    sizeof (struct mcxe_rx_ring));
		port->rx_rings = NULL;
	}
}

/*
 * mcxe_alloc_rings()
 */
static void
mcxe_alloc_rings(mcxe_port_t *port)
{
	struct mcxe_tx_ring *tx_ring;
	struct mcxe_rx_ring *rx_ring;
	int i;

	/* Allocate tx rings */
	port->tx_rings = kmem_zalloc(MCXE_TX_RING_MAX *
	    sizeof (struct mcxe_tx_ring), KM_SLEEP);
	for (i = 0; i < port->num_tx_rings; i++) {
		tx_ring = &port->tx_rings[i];
		tx_ring->port = port;
		/* initialize required tx locks */
		mutex_init(&tx_ring->txbuf_lock, NULL, MUTEX_DRIVER,
		    DDI_INTR_PRI(port->mcxnex_state->hs_intrmsi_pri));
		mutex_init(&tx_ring->freetxbuf_lock, NULL, MUTEX_DRIVER,
		    DDI_INTR_PRI(port->mcxnex_state->hs_intrmsi_pri));
		mutex_init(&tx_ring->tc_lock, NULL, MUTEX_DRIVER,
		    DDI_INTR_PRI(port->mcxnex_state->hs_intrmsi_pri));
		/* allocate tx buf array */
		tx_ring->txbuf_head = kmem_zalloc(
		    MCXE_TX_SLOTS * sizeof (mcxe_queue_item_t), KM_SLEEP);
	}

	/* Allocate rx rings */
	port->rx_rings = kmem_zalloc(MCXE_RX_RING_MAX *
	    sizeof (struct mcxe_rx_ring), KM_SLEEP);
	for (i = 0; i < port->num_rx_rings; i++) {
		rx_ring = &port->rx_rings[i];
		rx_ring->port = port;
		/* initialize required rx locks */
		mutex_init(&rx_ring->rx_lock, NULL, MUTEX_DRIVER,
		    DDI_INTR_PRI(port->mcxnex_state->hs_intrmsi_pri));
		rw_init(&rx_ring->rc_rwlock, NULL, RW_DRIVER,
		    DDI_INTR_PRI(port->mcxnex_state->hs_intrmsi_pri));
	}
}

typedef struct {
	offset_t	index;
	char		*name;
} mcxe_ksindex_t;

static const mcxe_ksindex_t mcxe_driverinfo[] = {
	{ 0,				"tx_free"		},
	{ 1,				"tx_bcopy"		},
	{ 2,				"tx_nobd"		},
	{ 3,				"tx_nobuf"		},
	{ 4,				"tx_bindfail"		},
	{ 5,				"tx_bindexceed"		},
	{ 6,				"tx_alloc_fail"		},
	{ 7,				"tx_pullup"		},
	{ 8,				"tx_drop"		},
	{ 9,				"tx_resched_needed"	},
	{ 10,				"tx_resched"		},

	{ 11,				"num_tx_rings"		},
	{ 12,				"tx_ring_size"		},
	{ 13,				"tx_buff_size"		},
	{ 14,				"max_tx_frags"		},
	{ 15,				"tx_copy_thresh"	},

	{ 16,				"num_rx_rings"		},
	{ 17,				"rx_ring_size"		},
	{ 18,				"rx_buff_size"		},
	{ 19,				"rx_copy_thresh"	},
	{ 20,				"rx_free"		},
	{ 21,				"rx_bind"		},
	{ 22,				"rx_bcopy"		},
	{ 23,				"rx_postfail"		},
	{ 24,				"rx_allocfail"		},

	{ -1,				NULL 			}
};

static int
mcxe_driverinfo_update(kstat_t *ksp, int flag)
{
	mcxe_port_t *port;
	kstat_named_t *knp;
	struct mcxe_tx_ring *tx_ring;
	struct mcxe_rx_ring *rx_ring;

	if (flag != KSTAT_READ)
		return (EACCES);

	port = ksp->ks_private;
	tx_ring = &port->tx_rings[0];
	rx_ring = &port->rx_rings[0];
	knp = ksp->ks_data;

	(knp++)->value.ui64 = tx_ring->tx_free;
	(knp++)->value.ui64 = tx_ring->tx_bcopy;
	(knp++)->value.ui64 = tx_ring->tx_nobd;
	(knp++)->value.ui64 = tx_ring->tx_nobuf;
	(knp++)->value.ui64 = tx_ring->tx_bindfail;
	(knp++)->value.ui64 = tx_ring->tx_bindexceed;
	(knp++)->value.ui64 = tx_ring->tx_alloc_fail;
	(knp++)->value.ui64 = tx_ring->tx_pullup;
	(knp++)->value.ui64 = tx_ring->tx_drop;
	(knp++)->value.ui64 = tx_ring->tx_resched_needed;
	(knp++)->value.ui64 = tx_ring->tx_resched;
	(knp++)->value.ui64 = port->num_tx_rings;
	(knp++)->value.ui64 = port->tx_ring_size;
	(knp++)->value.ui64 = port->tx_buff_size;
	(knp++)->value.ui64 = port->max_tx_frags;
	(knp++)->value.ui64 = port->tx_copy_thresh;


	(knp++)->value.ui64 = port->num_rx_rings;
	(knp++)->value.ui64 = port->rx_ring_size;
	(knp++)->value.ui64 = port->rx_buff_size;
	(knp++)->value.ui64 = port->rx_copy_thresh;
	(knp++)->value.ui64 = rx_ring->rx_free;
	(knp++)->value.ui64 = rx_ring->rx_bind;
	(knp++)->value.ui64 = rx_ring->rx_bcopy;
	(knp++)->value.ui64 = rx_ring->rx_postfail;
	(knp++)->value.ui64 = rx_ring->rx_allocfail;

	return (0);
}

static kstat_t *
mcxe_init_kstats(mcxe_port_t *port, int instance)
{
	const mcxe_ksindex_t *ksip = mcxe_driverinfo;
	kstat_t *ksp;
	kstat_named_t *knp;
	char *np;
	size_t size;

	size = sizeof (mcxe_driverinfo) / sizeof (mcxe_ksindex_t);
	ksp = kstat_create(MCXE_MODULE_NAME, instance, "driverinfo", "net",
	    KSTAT_TYPE_NAMED, size - 1, KSTAT_FLAG_PERSISTENT);
	if (ksp == NULL)
		return (NULL);

	ksp->ks_private = port;
	ksp->ks_update = mcxe_driverinfo_update;
	for (knp = ksp->ks_data; (np = ksip->name) != NULL; ++knp, ++ksip)
		kstat_named_init(knp, np, KSTAT_DATA_UINT64);
	kstat_install(ksp);

	return (ksp);
}

static int
mcxe_mac_register(mcxe_port_t *port)
{
	mac_register_t *mac;
	int ret;

	if (mcxe_get_primary_mac(port) != DDI_SUCCESS)
		return (DDI_FAILURE);

	if ((mac = mac_alloc(MAC_VERSION)) == NULL) {
		cmn_err(CE_WARN, "!mcxe_mac_register: invalid MAC version");
		return (DDI_FAILURE);
	}

	mac->m_type_ident = MAC_PLUGIN_IDENT_ETHER;
	mac->m_driver = port;
	mac->m_dip = port->devinfo;
	mac->m_src_addr = ((uint8_t *)&port->hw_mac) + 2;
	mac->m_callbacks = &mcxe_mac_callbacks;
	mac->m_min_sdu = 0;
	mac->m_max_sdu = port->default_mtu;
	mac->m_margin = VLAN_TAGSZ;

	ret = mac_register(mac, &port->mac_hdl);
	mac_free(mac);
	if (ret) {
		cmn_err(CE_WARN, "!mcxe%d: failed to register mac (ret %d)",
		    port->instance, ret);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}

static int
mcxe_unattach(mcxe_port_t *port, int port_inst)
{
	int i, ret;

