Arquivotheca/solaris11/usr/src/uts/common/io/mcxe/mcxe.c
	if (mcxe_verbose)
		cmn_err(CE_NOTE, "!==>mcxe_unattach() mcxe%d.\n", port_inst);

	for (i = 0; port->rxb_pending && i < 100; i++) {
		/* wait for rxb to be freed ... */
		drv_usecwait(100);
	}
	if (port->rxb_pending) /* rxb is still in-use */
		return (DDI_FAILURE);

	if (port->progress & MCXE_PRG_SOFT_INTR) {
		mcxnex_priv_async_cb_set(port->mcxnex_state, NULL);
		ddi_remove_softintr(port->link_softintr_id);
		port->progress &= ~MCXE_PRG_SOFT_INTR;
	}

	if (port->mcxe_kstats != NULL) {
		kstat_delete(port->mcxe_kstats);
		port->mcxe_kstats = NULL;
	}

	if (port->periodic_id != NULL) {
		ddi_periodic_delete(port->periodic_id);
		port->periodic_id = NULL;
	}

	if (port->progress & MCXE_PRG_MAC_REGISTER) {
		ret = mac_unregister(port->mac_hdl);
		if (ret != DDI_SUCCESS) {
			cmn_err(CE_WARN, "!mac unregistered failed");
			return (DDI_FAILURE);
		}
		port->progress &= ~MCXE_PRG_MAC_REGISTER;
	}

	if (port->progress & MCXE_PRG_ALLOC_RSRC) {
		mcxe_free_rsrc(port);
		port->progress &= ~MCXE_PRG_ALLOC_RSRC;
	}

	if (port->progress & MCXE_PRG_ALLOC_RINGS) {
		(void) mcxe_free_rings(port);
		port->progress &= ~MCXE_PRG_ALLOC_RINGS;
	}

	if (port->progress & MCXE_PRG_MUTEX) {
		mutex_destroy(&port->link_softintr_lock);
		rw_destroy(&port->port_rwlock);
		mutex_destroy(&port->port_lock);
		port->progress &= ~MCXE_PRG_MUTEX;
	}

	if (port->progress & MCXE_PRG_ALLOC_SOFTSTAT)
		ddi_soft_state_free(mcxe_statep, port_inst);

	return (DDI_SUCCESS);
}


/*
 * ====== Module Initialization Functions ======
 */
static int
mcxe_attach(dev_info_t *devinfo, ddi_attach_cmd_t cmd)
{
	mcxnex_ppd_t *ppd;
	mcxe_port_t *port;
	int port_inst;
	int ret;

	/*
	 * Check the command and perform corresponding operations
	 */
	switch (cmd) {
	default:
	case DDI_RESUME:
		return (DDI_FAILURE);

	case DDI_ATTACH:
		break;
	}

	/* get and verify the parent data info */
	ppd = ddi_get_parent_data(devinfo);
	if (ppd == NULL) {
		cmn_err(CE_WARN, "!mcxe_attach: no parent data!\n");
		return (DDI_FAILURE);
	}
	if (ppd->cp_state == NULL) {
		cmn_err(CE_WARN, "!mcxe_attach: invalid parent data!\n");
		return (DDI_FAILURE);
	}
	if (!ppd->cp_state->hs_devlim.reserved_lkey) {
		cmn_err(CE_WARN, "!mcxe_attach: device has no private lkey");
		return (DDI_FAILURE);
	}

	/* allocat port soft structure */
	port_inst = ddi_get_instance(devinfo);
	ret = ddi_soft_state_zalloc(mcxe_statep, port_inst);
	if (ret != DDI_SUCCESS) {
		cmn_err(CE_WARN,
		    "!mcxe_attach: unable to allocate soft mcxe%d state\n",
		    port_inst);
		return (DDI_FAILURE);
	}
	port = ddi_get_soft_state(mcxe_statep, port_inst);
	port->progress |= MCXE_PRG_ALLOC_SOFTSTAT;

	port->devinfo = devinfo;
	port->instance = port_inst;
	port->mcxnex_state = ppd->cp_state;
	port->phys_port_num = ppd->cp_port + 1;
	ASSERT(port->phys_port_num <= MCXE_MAX_PORT_NUM);

	/* get driver configuration parameters */
	mcxe_get_drv_conf(port);
	/* initialize driver parameters */
	mcxe_create_profile(port);

	/* init port locks */
	mutex_init(&port->port_lock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(port->mcxnex_state->hs_intrmsi_pri));
	rw_init(&port->port_rwlock, NULL, RW_DRIVER,
	    DDI_INTR_PRI(port->mcxnex_state->hs_intrmsi_pri));
	mutex_init(&port->link_softintr_lock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(port->mcxnex_state->hs_intrmsi_pri));
	port->progress |= MCXE_PRG_MUTEX;

	/* allocate rx/tx rings array */
	mcxe_alloc_rings(port);
	port->progress |= MCXE_PRG_ALLOC_RINGS;

	/* register to MAC */
	if (mcxe_mac_register(port) != DDI_SUCCESS)
		goto attach_fail;
	port->progress |= MCXE_PRG_MAC_REGISTER;
	port->link_state = LINK_STATE_UNKNOWN;
	mac_link_update(port->mac_hdl, LINK_STATE_UNKNOWN);
	port->periodic_id = ddi_periodic_add(mcxe_port_timer, port,
	    MCXE_CYCLIC_PERIOD, DDI_IPL_0);
	if (port->periodic_id == NULL) {
		cmn_err(CE_WARN,
		    "!mcxe%d: Failed to add the link check timer.", port_inst);
		goto attach_fail;
	}

	/* create & initialise named kstats */
	port->mcxe_kstats = mcxe_init_kstats(port, port_inst);

	/* add soft interrupt handler */
	ret = ddi_add_softintr(devinfo, DDI_SOFTINT_MED,
	    &port->link_softintr_id, NULL, NULL, mcxe_link_softintr_handler,
	    (caddr_t)port);
	if (ret != DDI_SUCCESS)
		goto attach_fail;
	mcxnex_priv_async_cb_set(port->mcxnex_state, mcxe_async_handler);
	port->progress |= MCXE_PRG_SOFT_INTR;

	if (mcxe_verbose) {
		cmn_err(CE_NOTE, "!mcxe_attach() OK on instance %d, port %d\n",
		    port_inst, port->phys_port_num);
	}

	return (DDI_SUCCESS);

attach_fail:
	cmn_err(CE_WARN, "!mcxe_attach() FAIL on instance%d(progress=0x%x).\n",
	    port_inst, port->progress);
	(void) mcxe_unattach(port, port_inst);
	return (DDI_FAILURE);
}

static int
mcxe_detach(dev_info_t *devinfo, ddi_detach_cmd_t cmd)
{
	int port_inst;
	mcxe_port_t *port;

	/*
	 * Check detach command
	 */
	switch (cmd) {
	default:
	case DDI_SUSPEND:
		return (DDI_FAILURE);

	case DDI_DETACH:
		break;
	}

	port_inst = ddi_get_instance(devinfo);
	port = ddi_get_soft_state(mcxe_statep, port_inst);
	ASSERT(port != NULL);

	return (mcxe_unattach(port, port_inst));
}


DDI_DEFINE_STREAM_OPS(mcxe_dev_ops,
	nulldev,	/* identify */
	nulldev,	/* probe */
	mcxe_attach,	/* attach */
	mcxe_detach,	/* detach */
	nodev,		/* reset */
	NULL,		/* cb_ops */
	D_MP,		/* bus_ops */
	NULL,		/* power */
	ddi_quiesce_not_needed	/* quiesce */
	/* chip quiesce is done in parent mcxnex driver */
);

static struct modldrv mcxe_modldrv = {
	&mod_driverops,		/* Type of module.  This one is a driver */
	mcxe_ident,		/* Discription string */
	&mcxe_dev_ops		/* driver ops */
};

static struct modlinkage mcxe_modlinkage = {
	MODREV_1, &mcxe_modldrv, NULL
};

int
_init(void)
{
	int ret;

	ret = ddi_soft_state_init(&mcxe_statep, sizeof (mcxe_port_t), 0);
	if (ret != DDI_SUCCESS)
		return (ret);

	mac_init_ops(&mcxe_dev_ops, MCXE_MODULE_NAME);

	ret = mod_install(&mcxe_modlinkage);
	if (ret != DDI_SUCCESS) {
		mac_fini_ops(&mcxe_dev_ops);
		ddi_soft_state_fini(&mcxe_statep);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}

int
_fini(void)
{
	int ret;

	ret = mod_remove(&mcxe_modlinkage);
	if (ret != DDI_SUCCESS)
		return (DDI_FAILURE);

	mac_fini_ops(&mcxe_dev_ops);
	ddi_soft_state_fini(&mcxe_statep);

	return (DDI_SUCCESS);
}

int
_info(struct modinfo *modinfop)
{
	return (mod_info(&mcxe_modlinkage, modinfop));
}
